# Классификация сетей
* Тип коммутации
    1. __Коммутация каналов__. В данном случае перед тем как начать передачу данных, необходиму создать соединение между отправителем и получателем, посредством узлов. Затем все данные идут по установленному соединению. Если узел, через который происходит соединение выходит из строя, все соединение выходит из строя. Подобная комутация используется в телефонной сети.
    В данном случае не приходится решать __задачу маршрутизации__ так как все данные идут по одному и тому же пути.
    <img src="./images/chanel_comutation.png" alt="alt text" width="400"/>
    <br>

    2. __Коммутация пакетов__. Данные делятся на отдельные части - пакеты, которые передаются отдельно, независимо друг от друга и могут идти по разным узлам. Преимуществом является - отказоустойчивость. Если выйдет из строя один из узлов, можно будет найти другой узел и передать через него. Подобная комутация используется в компьютерных сетях.
    Когда пакет достигает какого-то узла, нужно решить __задачу маршрутизации__ - уда дальше отправлять пакет? Эта задача должна решаться для каждого пакета отдельно на каждом промежуточном устройстве. Это создает вычислительную нагрузку.
    <img src="./images/package_comutation.png" alt="alt text" width="200"/>
    <br>

* Технология передачи данных
    1. __Широковещательные сети (broadcast network)__. В данном случае любые данные, которые передаются в сеть - доступны другим пользователем сети.
    <img src="./images/broadcast network.png" alt="alt text" width="200"/>
    2. __Точка-точка__. В данном случае данные передаются от компьютера к компьютеру. Иногда приходится передаватьданные через несколько связных между собой узлов.
    <img src="./images/point_to_point.png" alt="alt text" width="200"/>
    <br>

* Протяженность сети
    1. __Персональные__
    2. __Локальные__
    3. __Муниципальные__
    4. __Глобальная__
    5. __Объединение сетей__
    <img src="./images/long_networks.png" alt="alt text" width="900"/>
<br>


# Топология компьютерных сетей.
__Топология__ - это способ соединения компьютеров между собой в сеть. Это __Граф__, в котором __вершины__ - узлы сети (компьютеры и сетевое оборудование), а __ребра__ - связи между узлами (физические или информационные)
__Физическая топология__ - соединение устройств в сети.
__Логическая топология__ - правила распространения сигналов в сети.

Например __классический Ethernet__ имеет __физическую топологию__ звезда__, все устройства подключаются к одному устройству.
А __логическая топология__ - общая шина. Потому что устройство, передает данные поступившие в один порт, во все остальные порты.
<img src="./images/ethernet_topology_example.png" alt="alt text" width="800"/>
<br>

__Коммутируемый Ethernet__ так же испльзует физическую топологию __звезда__, но внутри комутатор обеспечивает логическую топологию __полной связи__, где каждый компьютер может быть соединен с другим компьютером напрямую.
<img src="./images/commutation_ethernet_example.png" alt="alt text" width="800"/>
<br>

В случае с __Wi-Fi__ вообще нет физической топологии, так как устройства подключаются дистанционно. А логическая топология __общая шина__. Все, что компьютер передает через радиоэфир могут принять все компьютеры, которые находятся в зоне действия педедатчика.
<br>

1. __Полносвязная топология__. Это такая топология. в которой каждое устройство связано со всеми устройствами. Плюсы такой топологии в том, что данные можно передавать с любого компьютера другому напрямую. Недостаток - нужно много соединений и сетевых адаптеров. Если сеть содержит дохуя компьютеров, то такая сеть просто невозможна.
<img src="./images/full_topology.png" alt="alt text" width="400"/>
<br>

2. __Ячеистая топология__. Это как полносзвязная топология, но из которой удалены некоторые соединения.
<img src="./images/not_full_topology.png" alt="alt text" width="400"/>
<br>

3. __Звезда__. В данном случае устройства подключаются не напрямую друг к другу, а к центральному устройству. Передача данных выполняется с помощью этого устройства. В качестве устройства используется сетевое устройство: комутатор, концентратор, точко доступа wifi, маршрутизатор.
<img src="./images/star_topology.png" alt="alt text" width="400"/>
<br>

4. __Кольцо__. В данном случае передача данных выполняется по кольцу.
<img src="./images/ring.png" alt="alt text" width="400"/>
<br>

5. __Дерево__. В данном случае сетевое оборудование и компьютеры образуют древовидную структуру. Передача файлов происходит через несклько промежуточных узлов.
<img src="./images/tree_topology.png" alt="alt text" width="400"/>
<br>

6. __Общая шина__. Все компьютеры в сети подключены к некоторой среде. В простом случае - это обычный медный кабель, который идет вдоль всех компьютеров. Данные, которые передаются в эту среду передаются всем компьютерам.
<img src="./images/bus_topology.png" alt="alt text" width="400"/>

7. __Смешанная топология__. Обычнов крупной сети исопльзуется смешанная топология.
<img src="./images/mixed_topology.png" alt="alt text" width="600"/>

# Стандарты компьютерных сетей.
__de jure__ (формальные, юридические) - стандарты, принятые по формальным законам стандатизации.
__de facto__ (фактические) - стандарты, установившиеся сами собой.

__ISO__ (Международная организация по стандартам) - эталонная модель взаимодействия открытых сетей.

__IEEE__ (Институт инжетнеров по электронике и электротехнике) - технология передачи данных.
Разработкой разных стандартов занимаются разные коммитеты, вот их номера:
<img src="./images/IEEE_standarts.png" alt="alt text" width="500"/>

__IAB__ (Совет по архитектуре интеренета) - протоколы интернет
Состоит из:
* Группа исследований Интернет (Internet Research Task Force, IRTF) - долгосрочные перспективные исследования
* Группа проектирования Интернет (Internet Engineering Task Force, IETF) - Выпускает стандарты на сетевые протоколы. А так же они разрабатывают - RFC (Request for comments) - документы с описанием работы протоколов.
Каждый документ RFC описывает свой протокол и имеет свой номер, например:
RFC 793 - протокол TCP
RFC 791 - протокол IP
RFC 826 - протокол ICMP
RFC 2131 - протокол DHCP

* __W3C__ (Консорциум, World Wide Wev Consorcium) - стандарты WEB. Документы называются W3C.
Так же они разрабатывают Рекомендации W3C:
* Язык разметки HTML
* Таблицы стилей CSS
* Архитектура Web-сервисов
* Язык разметки XML
